In [1]:
import numpy as np
import pandas as pd

In [3]:
import os

In [17]:
print(os.chdir(r'D:\Data_Science\jupyter_notebook\joyful-pandas\data'))

None

In [18]:
os.chdir(r'D:\Data_Science\jupyter_notebook\joyful-pandas\data')

In [49]:
df = pd.read_csv('learn_pandas.csv')
df.groupby('Gender')['Height'].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [20]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [21]:
gb = df.groupby(['School', 'Grade'])
gb

In [22]:
gb.ngroups

16

In [24]:
gb.cummax().head()

   Height  Weight  Test_Number
0   158.9    46.0            1
1   166.5    70.0            1
2   188.9    89.0            2
3     NaN    41.0            2
4   174.0    74.0            2

In [26]:
gb.transform('mean').head() # 传入返回标量的函数也是可以的

       Height     Weight  Test_Number
0  165.683333  59.833333     1.538462
1  164.991667  60.461538     1.769231
2  165.390476  59.850000     1.590909
3  168.183333  60.125000     1.625000
4  168.183333  60.125000     1.625000

In [28]:
gb

In [50]:
gb = df[['Height', 'Weight','School', 'Grade']].groupby(['School', 'Grade'])
gb

In [52]:
gb.mean()

                                             Height     Weight
School                        Grade
Fudan University              Freshman   160.950000  52.444444
                              Junior     161.433333  53.166667
                              Senior     161.118182  51.727273
                              Sophomore  168.183333  60.125000
Peking University             Freshman   164.991667  60.461538
                              Junior     162.314286  51.833333
                              Senior     163.285714  57.428571
                              Sophomore  158.640000  42.750000
Shanghai Jiao Tong University Freshman   165.683333  59.833333
                              Junior     160.976471  50.000000
                              Senior     165.390476  59.850000
                              Sophomore  163.660000  54.000000
Tsinghua University           Freshman   160.360000  47.470588
                              Junior     164.880952  57.863636
                              Senior     164.421429  55.285714
                              Sophomore  162.200000  55.642857

In [53]:
gb.filter(lambda x: x['Height'].mean() > 100).head()

   Height  Weight                         School      Grade
0   158.9    46.0  Shanghai Jiao Tong University   Freshman
1   166.5    70.0              Peking University   Freshman
2   188.9    89.0  Shanghai Jiao Tong University     Senior
3     NaN    41.0               Fudan University  Sophomore
4   174.0    74.0               Fudan University  Sophomore

In [71]:
df2 = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar2'],
                   'B' : [1, 2, 1.5, 4, 1.5, 6],
                   'C' : [2.0, 5., 8., 1., 2., 9.]})

In [72]:
df2

      A    B    C
0   foo  1.0  2.0
1   bar  2.0  5.0
2   foo  1.5  8.0
3   bar  4.0  1.0
4   foo  1.5  2.0
5  bar2  6.0  9.0

In [73]:
grouped = df2.groupby('A')

### x.shape[0] 用于统计A分组后有几种情况

In [74]:
grouped.filter(lambda x: x.shape[0] >= 2)

     A    B    C
0  foo  1.0  2.0
1  bar  2.0  5.0
2  foo  1.5  8.0
3  bar  4.0  1.0
4  foo  1.5  2.0

In [ ]:
grouped.filter(lambda x: x['B'].mean() > 3.)